[LWS_Arsonist X2SoldierClassTemplate]
DisplayName="Arsonist"
ClassSummary="The Arsonist is a dedicated front-liner specializing in the use of Chemthrowers and their accompanying Canisters. Their greatest strengths in the field are crowd control and engaging stubborn foes dug in behind full cover."
LeftAbilityTreeTitle="Scorched Earth"
RightAbilityTreeTitle="Intensity"
AbilityTreeTitles[0]="Scorched Earth"
AbilityTreeTitles[1]="Slaughter"
AbilityTreeTitles[2]="Intensity"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

;ALPHABETICAL ORDER
RandomNickNames[0]="Ace of Spades"
RandomNickNames[1]="Atrocity"
RandomNickNames[2]="Backburner"
RandomNickNames[3]="Beatdown"
RandomNickNames[4]="Black Death"
RandomNickNames[5]="Bone Breaker"
RandomNickNames[6]="Cold Blooded"
RandomNickNames[7]="Cold Snap"
RandomNickNames[8]="Cryptkeeper"
RandomNickNames[9]="Death Dealer"
RandomNickNames[10]="Devil"
RandomNickNames[11]="Doom"
RandomNickNames[12]="Dragon"
RandomNickNames[13]="Effigy"
RandomNickNames[14]="Evil Genius"
RandomNickNames[15]="Fallen Angel"
RandomNickNames[16]="Fireball"
RandomNickNames[17]="Gear"
RandomNickNames[18]="Hydra"
RandomNickNames[19]="Ifrit"
RandomNickNames[20]="Jackknife"
RandomNickNames[21]="Jet"
RandomNickNames[22]="Lights Out"
RandomNickNames[23]="Mage"
RandomNickNames[24]="Magma"
RandomNickNames[25]="Minotaur"
RandomNickNames[26]="One-Winged Angel"
RandomNickNames[27]="Pitfall"
RandomNickNames[28]="Plague"
RandomNickNames[29]="Rainfall"
RandomNickNames[30]="Rattlesnake"
RandomNickNames[31]="Rebound"
RandomNickNames[32]="Red Death"
RandomNickNames[33]="Rise"
RandomNickNames[34]="Ripper"
RandomNickNames[35]="Salamander"
RandomNickNames[36]="Scream"
RandomNickNames[37]="Sendoff"
RandomNickNames[38]="Shade"
RandomNickNames[39]="Shakedown"
RandomNickNames[40]="Searing"
RandomNickNames[41]="Shifty"
RandomNickNames[42]="Shots Fired"
RandomNickNames[43]="Singe"
RandomNickNames[44]="Soul Taker"
RandomNickNames[45]="Spectral"
RandomNickNames[46]="Spit Break"
RandomNickNames[47]="Tactical Nuke"
RandomNickNames[48]="Tear Down"
RandomNickNames[49]="Terror"
RandomNickNames[50]="Tombstone"
RandomNickNames[51]="Venomous"
RandomNickNames[52]="Viper"
RandomNickNames[53]="War Dog"
RandomNickNames[54]="Wizard"
RandomNickNames[55]="Wrath"
RandomNickNames[56]="Yeti"
RandomNickNames[57]="Zero"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Demon King"
RandomNickNames_Male[1]="Fireman"
RandomNickNames_Male[2]="Overlord"
RandomNickNames_Male[3]="Papa Wolf"
RandomNickNames_Female[0]="Ember"
RandomNickNames_Female[1]="Empress"
RandomNickNames_Female[2]="Mama Bear"
RandomNickNames_Female[3]="Sorceress"
;ALPHABETICAL ORDER

PhotoboothSoloBLines_Male[0]="The forecast calls for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Male[1]="No Cover. No Mercy."
PhotoboothSoloBLines_Male[2]="Call him the chef, because he'll handle the cooking."
PhotoboothSoloBLines_Male[3]="Once more into the breach!"
PhotoboothSoloBLines_Male[4]="Stealth is overrated."

PhotoboothSoloBLines_Female[0]="The forecast calls for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Female[1]="No Cover. No Mercy."
PhotoboothSoloBLines_Female[2]="Call her the chef, because she'll handle the cooking."
PhotoboothSoloBLines_Female[3]="Once more into the breach!"
PhotoboothSoloBLines_Female[4]="Stealth is overrated."

[ArsonistHotshot X2AbilityTemplate]
LocFriendlyName="Hotshot"
LocLongDescription="Your ability to handle a Chemthrower is nothing short of unnatural. Gain the Quickburn and Fine Control abilities."
LocHelpText="Gain the Quickburn and Fine Control abilities."
LocFlyOverText="Hotshot"
LocPromotionPopupText="<Bullet/> Quickburn is an activated free action on a 5 turn cooldown that will make your next use of any ONE of these actions free -- your standard Chemthrower attack, or the Chemical Storm, Pressure Blast or Fulmination abilities.\n<Bullet/> Fine Control will ensure your Chemthrower's offensive actions never affect friendlies, and will also ensure the Medispray and Fumigate abilities never affect enemies."